import { Button, LinkButton, Title } from 'components'
import React from 'react'

type Props = {}

const BandInfoEdit = (props: Props) => {
  return (
    <div className='flex justify-center md:justify-end items-center h-screen md:mr-24 w-full '>
      {/* Content */}
      <div className='w-[77%]  h-[70vh] md:h-[80vh]  bg-[#FBFBFB] rounded-2xl flex flex-col justify-between items-center shadow-[inset_8px_8px_10px_0_rgba(0,0,0,0.3)]'>
        {/* Title */}
        <div className=' w-[80%] '>
          <Title
            className='pt-20 text-lg pb- !w-full'
            text='ბენდის შესახებ - დაარედაქტირე'
          />
        </div>

        <div className=' w-[80%] mb-8 mt-5 h-[460px] bg-[#E5E5E5] rounded-lg shadow-[5px_5px_15px_5px_rgba(0,0,0,0.5)]'>
          <div className='px-7 py-7 w-full h-full'>
            <textarea
              className='resize-none form-control block w-full h-full  text-base font-normal text-gray-700 bg-[#E5E5E5] bg-clip-padding  border-gray-300 rounded transition ease-in-out m-0 focus:outline-none overflow-y-scroll scrollbar-thin  scrollbar-thumb-blue-200 scrollbar-track-gray-600 scrollbar-thumb-rounded-full scrollbar-track-rounded-full pr-5'
              id='exampleFormControlTextarea1'
              placeholder='Your message'
            >
              დაწყვილების პერიოდი ზომიერ და არქტიკულ რეგიონებში მობინადრე მხოლოდ
              ოქტომბე-ნოემბერში, ამ პროცესს „დაგვიანებული იმპლანტაცია“ ეწოდება.
              დათვი შობს წარმოუდგენლად პატარა ბელებს, ხშირ შემთხვევაში — ორს.
              ახალშობილები მხოლოდ 200-700 გრამს იწონიან და ძალიან ჰგვანან პატარა
              ვირთხებს. ისინი თვალაუხელელნი, უკბილონი და ბეწვის გარეშე
              იბადებიან. პატარები რჩებიან რა ბუნაგში დედასთან, მისი ნოყიერი რძით
              იკვებებიან და სწრაფად იზრდებიან. როდესაც გაზაფხულზე ისინი ბარბაცით
              გამოდიან ბუნაგიდან და მზეს ეფიცხებიან, უკვე მოზრდილები არიან
              დათვები, როგორც წესი, ეულად ბინადრობენ, თუმცა საკვების მოპოვების
              დროს ხშირად იკრიბებიან. ბელები ორი-სამი წლის განმავლობაში დედასთან
              რჩებიან. ამ პერიოდში მდედრი დათვი კიდევ მაკეობს, ამგვარად, მამრი
              დაწყვილების პერიოდი ზომიერ და არქტიკულ რეგიონებში მობინადრე
              დათვებისთვის, ჩვეულებრივ, გაზაფხულია. მაკეობა ხანმოკლეა, თუმცა
              იმის გამო, რომ დათვი არ მშობიარობს მანამ, სანამ ზამთრის შუა ძილში
              არ იქნება, განაყოფიერებული კვერცხუჯრედის საშვილოსნოში იმპლანტაცია
              ხდება მხოლოდ ოქტომბე-ნოემბერში, ამ პროცესს „დაგვიანებული
              იმპლანტაცია“ ეწოდება. დათვი შობს წარმოუდგენლად პატარა ბელებს, ხშირ
              შემთხვევაში — ორს. ახალშობილები მხოლოდ 200-700 გრამს იწონიან და
              ძალიან ჰგვანან პატარა ვირთხებს. ისინი თვალაუხელელნი, უკბილონი და
              ბეწვის გარეშე იბადებიან. პატარები რჩებიან რა ბუნაგში დედასთან,
              მისი ნოყიერი რძით იკვებებიან და სწრაფად იზრდებიან. როდესაც
              გაზაფხულზე ისინი ბარბაცით გამოდიან ბუნაგიდან და მზეს ეფიცხებიან,
              უკვე მოზრდილები არიან დათვები, როგორც წესი, ეულად ბინადრობენ,
              თუმცა საკვების მოპოვების დროს ხშირად იკრიბებიან. ბელები ორი-სამი
              წლის განმავლობაში დედასთან რჩებიან. ამ პერიოდში მდედრი დათვი კიდევ
              მაკეობს, ამგვარად, მამრი დათვებიც ცხოვრების რაღაც ნაწილს
              ნაშიერებთან ატარებენ.საუკუნეების განმავლობაში დათვების ყველა
              სახეობაზე ნადირობდნენ. გამოსადეგია დათვის ხორცი, ტყავი, ცხიმი, მათ
              აბარებე ზოოპარკებში ან უბრალოდ სპორტული ინტერესის გამო ნადირობდნენ
              მათზე. ყველაზე დიდი ზიანი მიიღო გრიზლიმ. თუმცა გადაშენების გზაზეა
              ჰიმალაიური, მალაიური და სათვალიანი დათვებიც. შედარებით ნაკლები
              საფრთხის ქვეშ იმყოფება ბარიბალი, თუმცა წარსულში მასზე იყო
              გაჩაღებული უმოწყალო ნადირობა. ერთ დროს დიდი საფრთხე ემუქრებოდა
              თეთრ დათვსაც, თუმცა 1970 წლიდან მათ განსაკუთრებით იცავენ, რამაც ამ
              მტაცებლების რიცხვის საგრძნობი ზრდა გამოიწვია.
            </textarea>
          </div>
        </div>

        <div className=' flex flex-col items-center justify-center pb-5'>
          <Button text='შეინახე' className='bg-[#53C02C] h-10 mb-4 px-12' />
          <LinkButton text='გადი უკან' path={'/band-info'} />
        </div>
      </div>
    </div>
  )
}

export default BandInfoEdit
